01  WS-AREA. 
05  WS-COUNT PIC 9(5) VALUE 0. 
05  WS-TABLE OCCURS 10 TIMES INDEXED BY WS-INDEX. 
10  WS-TABLE-ENTRY PIC X(80). 

*... some code to populate WS-TABLE ...*

PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 10 
    IF WS-TABLE(WS-INDEX) = 'someValue' THEN 
       ADD 1 TO WS-COUNT 
    END-IF 
END-PERFORM

DISPLAY "Count: " WS-COUNT